In [1]:
import sqlite3

database = sqlite3.connect("database.db")
cursor = database.cursor()

print(cursor)

<sqlite3.Cursor object at 0x0000024DF4869EC0>

In [2]:
query_create_table = '''
CREATE TABLE IF NOT EXISTS students (
  id INTEGER PRIMARY KEY AUTOINCREMENT,
  name TEXT NOT NULL,
  age INTEGER NOT NULL
)
''' 

cursor.execute(query_create_table)
database.commit()

In [3]:
query_insert_data = '''
INSERT INTO students (name, age)
VALUES
  ('Alice', 20),
  ('Bob', 22),
  ('Arnold', 35)
'''

cursor.execute(query_insert_data)
database.commit()

In [4]:
query_select_data = '''
SELECT * FROM students
'''

cursor.execute(query_select_data)
students = cursor.fetchall()
print(students)

name_columns = [name[0] for name in cursor.description]
print(name_columns)

[(1, 'Alice', 20), (2, 'Bob', 22), (3, 'Arnold', 35), (4, 'Alice', 20), (5, 'Bob', 22), (6, 'Arnold', 35)]
['id', 'name', 'age']

In [5]:
query_select_avg = '''
SELECT AVG(age) FROM students
'''

cursor.execute(query_select_avg)
ageAVG = cursor.fetchall()
print(ageAVG)

[(25.666666666666668,)]

In [6]:
for student in students:
  print(f"ID: {student[0]}, Name: {student[1]}, Age: {student[2]}")

cursor.close()
database.close()

ID: 1, Name: Alice, Age: 20
ID: 2, Name: Bob, Age: 22
ID: 3, Name: Arnold, Age: 35
ID: 4, Name: Alice, Age: 20
ID: 5, Name: Bob, Age: 22
ID: 6, Name: Arnold, Age: 35

In [10]:
import pandas as pd

dataf = pd.DataFrame(students, columns=["ID", "Name", "Age"])

dataf.head(5)

   ID    Name  Age
0   1   Alice   20
1   2     Bob   22
2   3  Arnold   35
3   4   Alice   20
4   5     Bob   22

In [8]:
print(dataf["Age"].mean())

25.666666666666668